taskt/Core/Automation/Commands/WindowGroup/GetWindowHandlesFromWindowNamesAsDataTableCommand.dot
digraph "GetWindowHandlesFromWindowNamesAsDataTableCommand" {
"GetWindowHandlesFromWindowNamesAsDataTableCommand" -> "GetFromWindowNamesAsDataTableCommands";
"GetFromWindowNamesAsDataTableCommands" -> "AWindowNamesCommands";
"GetFromWindowNamesAsDataTableCommands" -> "IDataTableResultProperties";
"AWindowNamesCommands" -> "AWindowNameCoreCommands";
"AWindowNamesCommands" -> "IWindowNamesProperties";
"AWindowNamesCommands" -> "ICanHandleList";
"AWindowNameCoreCommands" -> "ScriptCommand";
"AWindowNameCoreCommands" -> "IWindowNameCoreProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
